dadamachines/ArduinoCore-samd/variants/composer_pro/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_COMPOSER_PRO_
#define _VARIANT_COMPOSER_PRO_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK			  (120000000ul)

#define VARIANT_GCLK0_FREQ (120000000UL)
#define VARIANT_GCLK1_FREQ (48000000UL)
#define VARIANT_GCLK2_FREQ (100000000UL)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#define PINS_COUNT           (128u)
#define NUM_DIGITAL_PINS     (20u)      // TO DO !! set to correct value
#define NUM_ANALOG_INPUTS    (0u)       // TO DO !! set to correct value
#define NUM_ANALOG_OUTPUTS   (1u)       // TO DO !! set to correct value
//#define analogInputToDigitalPin(p)  ((p < NUM_ANALOG_INPUTS) ? (p) + PIN_A0 : -1)     // TO DO !! set to correct value

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

    
/////////////////////////////////////////////////////////////////////////////////////////////
///// MASTER SAMD PINS //////////////////////////////////////////////////////////////////////
    
#define M_PA00      0
#define M_PA01      1
#define M_PA02      2
#define M_PA03      3           // AREF
#define M_PA04      4           // BUS_I2C_1_SDA 
#define M_PA05      5           // BUS_I2C_1_SCL 
#define M_PA06      6
#define M_PA07      7           // WS28 RGB LEDs
#define M_PA08      8           // FLASH_SD QSPI_D0     // MOSI for FRAM+SD
#define M_PA09      9           // FLASH_SD QSPI_D1     // SCK  for FRAM+SD
#define M_PA10     10           // FLASH_SD QSPI_D2     // CS/SS for FRAM
#define M_PA11     11           // FLASH_SD QSPI_D3     // MISO for FRAM+SD
#define M_PA12     12           // BUS SPI > Compute Module MOSI
#define M_PA13     13           // BUS SPI > Compute Module SKC
#define M_PA14     14           // BUS SPI > Compute Module CS
#define M_PA15     15           // BUS SPI > Compute Module MISO
#define M_PA16     16           // BUS SPI > ICE 40 MOSI 
#define M_PA17     17           // BUS SPI > ICE 40 SCK
#define M_PA18     18           // BUS SPI > ICE 40 CS
#define M_PA19     19           // BUS SPI > ICE 40 MISO
#define M_PA20     20
#define M_PA21     21
#define M_PA22     22
#define M_PA23     23           
#define M_PA24     24           // USB_C IN DATA D_N
#define M_PA25     25           // USB_C IN DATA D_P
#define M_PA26     26
#define M_PA27     27           // RESET SLAVE SAMD 
#define M_PA28     28
#define M_PA29     29
#define M_PA30     30           // SWCLK
#define M_PA31     31           // SWDIO

#define M_PB00     ( 0+32)      // BUS_I2C_2_INT  MatrixTCA955 INT PIN
#define M_PB01     ( 1+32)      // BUS_I2C_2_INT  USB_C PD INT
#define M_PB02     ( 2+32)      // BUS_I2C_2_SDA  USB_C PD + MatrixTCA955
#define M_PB03     ( 3+32)      // BUS_I2C_2_SCL  USB_C PD + MatrixTCA955
#define M_PB04     ( 4+32)
#define M_PB05     ( 5+32)
#define M_PB06     ( 6+32)      // FOOTSWITCH 1
#define M_PB07     ( 7+32)      // FOOTSWITCH 2
#define M_PB08     ( 8+32)      // BUS SPI > ICE 40 CDONE
#define M_PB09     ( 9+32)      // BUS SPI > ICE 40 RESET
#define M_PB10     (10+32)      // FLASH_SD QSPI_SCK    // FRAM
#define M_PB11     (11+32)      // FLASH_SD QSPI_CS     // CS SD
#define M_PB12     (12+32)      // FLASH_SD QSPI_DE     // SD enable
#define M_PB13     (13+32)
#define M_PB14     (14+32)
#define M_PB15     (15+32)
#define M_PB16     (16+32)
#define M_PB17     (17+32)      // BUILTIN LED
#define M_PB18     (18+32)
#define M_PB19     (19+32)
#define M_PB20     (20+32)
#define M_PB21     (21+32)
#define M_PB22     (22+32)      // SWDIO from SLAVE SAMD
#define M_PB23     (23+32)      // SWCLK from SLAVE SAMD
#define M_PB24     (24+32)
#define M_PB25     (25+32)
#define M_PB26     (26+32)
#define M_PB27     (27+32)
#define M_PB28     (28+32)
#define M_PB29     (29+32)
#define M_PB30     (30+32)      // SWO
#define M_PB31     (31+32)


/////////////////////////////////////////////////////////////////////////////////////////////
///// SLAVe SAMD PINS ///////////////////////////////////////////////////////////////////////

